// Copyright 2017 The Fuchsia Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SRC_CONNECTIVITY_WLAN_LIB_COMMON_CPP_INCLUDE_WLAN_COMMON_ELEMENT_H_
#define SRC_CONNECTIVITY_WLAN_LIB_COMMON_CPP_INCLUDE_WLAN_COMMON_ELEMENT_H_

#include <fuchsia/wlan/mlme/cpp/fidl.h>
#include <zircon/assert.h>
#include <zircon/compiler.h>
#include <zircon/types.h>

#include <cstdint>
#include <unordered_map>
#include <utility>
#include <vector>

#include <ddk/hw/wlan/ieee80211.h>
#include <ddk/protocol/wlan/info.h>
#include <wlan/common/bitfield.h>
#include <wlan/common/element_id.h>
#include <wlan/common/logging.h>
#include <wlan/common/macaddr.h>

namespace wlan {

// IEEE Std 802.11-2016, 9.4.2.1
struct ElementHeader {
  uint8_t id;
  uint8_t len;
} __PACKED;

constexpr size_t kMaxSsidLen = 32;

// IEEE 802.11-2016 9.4.2.3.
// The MSB in a rate indicates "basic rate" and is ignored during comparison.
// Rates are in 0.5Mbps increment: 12 -> 6 Mbps, 11 -> 5.5 Mbps, etc.
struct SupportedRate : public common::BitField<uint8_t> {
  constexpr SupportedRate() = default;
  constexpr explicit SupportedRate(uint8_t val) : common::BitField<uint8_t>(val) {}
  constexpr explicit SupportedRate(uint8_t val, bool is_basic) : common::BitField<uint8_t>(val) {
    set_is_basic(static_cast<uint8_t>(is_basic));
  }

  static SupportedRate basic(uint8_t rate) { return SupportedRate(rate, true); }
  static SupportedRate raw(uint8_t rate) { return SupportedRate(rate); }

  WLAN_BIT_FIELD(rate, 0, 7)
  WLAN_BIT_FIELD(is_basic, 7, 1)

  operator uint8_t() const { return val(); }
  bool operator==(const SupportedRate& other) const { return rate() == other.rate(); }
  bool operator!=(const SupportedRate& other) const { return !this->operator==(other); }
  bool operator<(const SupportedRate& other) const { return rate() < other.rate(); }
  bool operator>(const SupportedRate& other) const { return rate() > other.rate(); }
} __PACKED;

static constexpr size_t kMaxSupportedRatesLen = 8;

// IEEE Std 802.11-2016, 9.4.2.4
struct DsssParamSet {
  uint8_t current_chan;
};

// IEEE Std 802.11-2016, 9.4.2.5
struct CfParamSet {
  uint8_t count;
  uint8_t period;
  uint16_t max_duration;
  uint16_t dur_remaining;
} __PACKED;

// IEEE Std 802.11-2016, 9.4.2.6
class BitmapControl : public common::BitField<uint8_t> {
 public:
  BitmapControl() = default;
  explicit BitmapControl(uint8_t raw) : BitField(raw) {}
  WLAN_BIT_FIELD(group_traffic_ind, 0, 1)
  WLAN_BIT_FIELD(offset, 1, 7)
};

// IEEE Std 802.11-2016, 9.4.2.6
struct TimHeader {
  uint8_t dtim_count;
  uint8_t dtim_period;
  BitmapControl bmp_ctrl;
} __PACKED;

constexpr size_t kMaxTimBitmapLen = 251;

// IEEE Std 802.11-2016, 9.4.2.9. Figure 9-131, 9-132.
struct SubbandTriplet {
  uint8_t first_channel_number;
  uint8_t number_of_channels;
  uint8_t max_tx_power;  // dBm
} __PACKED;

// IEEE Std 802.11-2016, 9.4.2.9
struct Country {
  static constexpr size_t kCountryLen = 3;
  uint8_t data[kCountryLen];
} __PACKED;
static_assert(sizeof(Country) == Country::kCountryLen);

const uint16_t kEapolProtocolId = 0x888E;

// IEEE Std 802.11-2016, 9.4.2.98
struct MeshConfiguration {
  enum PathSelProtoId : uint8_t {
    kHwmp = 1u,
  };

  enum PathSelMetricId : uint8_t {
    kAirtime = 1u,
  };

  enum CongestCtrlModeId : uint8_t {
    kCongestCtrlInactive = 0u,
    kCongestCtrlSignaling = 1u,
  };

  enum SyncMethodId : uint8_t {
    kNeighborOffsetSync = 1u,
  };

  enum AuthProtoId : uint8_t {
    kNoAuth = 0u,
    kSae = 1u,
    kIeee8021X = 2u,
  };

  struct MeshFormationInfo : public common::BitField<uint8_t> {
    MeshFormationInfo() = default;
    explicit MeshFormationInfo(uint8_t raw) : BitField(raw) {}

    WLAN_BIT_FIELD(connected_to_mesh_gate, 0, 1)
    WLAN_BIT_FIELD(num_peerings, 1, 6)
    WLAN_BIT_FIELD(connected_to_as, 7, 1)
  } __PACKED;

  ::fuchsia::wlan::mlme::MeshConfiguration ToFidl() const {
    ::fuchsia::wlan::mlme::MeshConfiguration ret;
    ret.active_path_sel_proto_id = static_cast<uint8_t>(active_path_sel_proto_id);
    ret.active_path_sel_metric_id = static_cast<uint8_t>(active_path_sel_metric_id);
    ret.congest_ctrl_method_id = static_cast<uint8_t>(congest_ctrl_method_id);
    ret.sync_method_id = static_cast<uint8_t>(sync_method_id);
    ret.auth_proto_id = static_cast<uint8_t>(auth_proto_id);
    ret.mesh_formation_info = mesh_formation_info.val();
    ret.mesh_capability = mesh_capability.val();
    return ret;
  }

  static MeshConfiguration FromFidl(const ::fuchsia::wlan::mlme::MeshConfiguration& f) {
    return MeshConfiguration{
        .active_path_sel_proto_id = static_cast<PathSelProtoId>(f.active_path_sel_proto_id),
        .active_path_sel_metric_id = static_cast<PathSelMetricId>(f.active_path_sel_metric_id),
        .congest_ctrl_method_id = static_cast<CongestCtrlModeId>(f.congest_ctrl_method_id),
        .sync_method_id = static_cast<SyncMethodId>(f.sync_method_id),
        .auth_proto_id = static_cast<AuthProtoId>(f.auth_proto_id),
        .mesh_formation_info = MeshFormationInfo(f.mesh_formation_info),
        .mesh_capability = MeshCapability(f.mesh_capability),
    };
  }

  struct MeshCapability : public common::BitField<uint8_t> {
    MeshCapability() = default;
    explicit MeshCapability(uint8_t raw) : BitField(raw) {}

    WLAN_BIT_FIELD(accepting_additional_peerings, 0, 1)
    WLAN_BIT_FIELD(mcca_supported, 1, 1)
    WLAN_BIT_FIELD(mcca_enabled, 2, 1)
    WLAN_BIT_FIELD(forwarding, 3, 1)
    WLAN_BIT_FIELD(mbca_enabled, 4, 1)
    WLAN_BIT_FIELD(tbtt_adjusting, 5, 1)
    WLAN_BIT_FIELD(power_save_level, 6, 1)
    // bit 7 is reserved
  } __PACKED;

  PathSelProtoId active_path_sel_proto_id;
  PathSelMetricId active_path_sel_metric_id;
  CongestCtrlModeId congest_ctrl_method_id;
  SyncMethodId sync_method_id;
  AuthProtoId auth_proto_id;
  MeshFormationInfo mesh_formation_info;
  MeshCapability mesh_capability;
} __PACKED;

constexpr size_t kMaxMeshIdLen = 32;

// IEEE Std 802.11-2016, 9.4.2.113, Figure 9-478
struct PreqFlags : public common::BitField<uint8_t> {
  WLAN_BIT_FIELD(gate_announcement, 0, 1)
  WLAN_BIT_FIELD(addressing_mode, 1, 1)
  WLAN_BIT_FIELD(proactive, 2, 1)
  // bits 3-5 reserved
  WLAN_BIT_FIELD(addr_ext, 6, 1)
  // bit 7 reserved
};

// Fixed-length fields of the PREQ element that precede
// the optional Originator External Address field.
// IEEE Std 802.11-2016, 9.4.2.113, Figure 9-477
struct PreqHeader {
  PreqFlags flags;
  uint8_t hop_count;
  uint8_t element_ttl;
  uint32_t path_discovery_id;
  common::MacAddr originator_addr;
  uint32_t originator_hwmp_seqno;
} __PACKED;

static_assert(sizeof(PreqHeader) == 17);

// Fixed-length fields of the PREQ elements that follow the optional Originator
// External Address field and precede the variable length per-target fields.
// IEEE Std 802.11-2016, 9.4.2.113, Figure 9-477
struct PreqMiddle {
  uint32_t lifetime;
  uint32_t metric;
  uint8_t target_count;
} __PACKED;

static_assert(sizeof(PreqMiddle) == 9);

// IEEE Std 802.11-2016, 9.4.2.113
constexpr size_t kPreqMaxTargets = 20;

// IEEE Std 802.11-2016, 9.4.2.113, Figure 9-479
struct PreqPerTargetFlags : public common::BitField<uint8_t> {
  WLAN_BIT_FIELD(target_only, 0, 1)
  // bit 1 reserved
  WLAN_BIT_FIELD(usn, 2, 1)
  // bits 3-7 reserved
};

// An entry of the variable-length part of PREQ
// IEEE Std 802.11-2016, 9.4.2.113, Figure 9-477
struct PreqPerTarget {
  PreqPerTargetFlags flags;
  common::MacAddr target_addr;
  uint32_t target_hwmp_seqno;
} __PACKED;

static_assert(sizeof(PreqPerTarget) == 11);

// IEEE Std 802.11-2016, 9.4.2.114, Figure 9-481
struct PrepFlags : public common::BitField<uint8_t> {
  PrepFlags() = default;
  explicit PrepFlags(uint8_t raw_value) : common::BitField<uint8_t>(raw_value) {}

  // bits 0-5 reserved
  WLAN_BIT_FIELD(addr_ext, 6, 1)
  // bit 7 reserved
};

// Fixed-length fields of the PREP element that precede
// the optional Target External Address field.
// IEEE Std 802.11-2016, 9.4.2.114, Figure 9-480
struct PrepHeader {
  PrepFlags flags;
  uint8_t hop_count;
  uint8_t element_ttl;
  common::MacAddr target_addr;
  uint32_t target_hwmp_seqno;
} __PACKED;

static_assert(sizeof(PrepHeader) == 13);

// Fixed-length fields of the PREP element that follow
// the optional Target External Address field.
// IEEE Std 802.11-2016, 9.4.2.114, Figure 9-480
struct PrepTail {
  uint32_t lifetime;
  uint32_t metric;
  common::MacAddr originator_addr;
  uint32_t originator_hwmp_seqno;
} __PACKED;

static_assert(sizeof(PrepTail) == 18);

// Fixed-length fields of the PERR element that precede the variable-length
// per-destination fields.
// IEEE Std 802.11-2016, 9.4.2.115
struct PerrHeader {
  uint8_t element_ttl;
  uint8_t num_destinations;
} __PACKED;

// IEEE Std 802.11-2016, 9.4.2.115, Figure 9-483
struct PerrPerDestinationFlags : public common::BitField<uint8_t> {
  // bits 0-5 reserved
  WLAN_BIT_FIELD(addr_ext, 6, 1)
  // bit 7 reserved
};

// Fixed-length fields of the per-destination chunk of the PERR element
// that precede the optional "Destination External Address" field.
// IEEE Std 802.11-2016, 9.4.2.115
struct PerrPerDestinationHeader {
  PerrPerDestinationFlags flags;
  common::MacAddr dest_addr;
  uint32_t hwmp_seqno;
} __PACKED;

// The fixed-length field of the per-destination chunk of the PERR element
// that follows the optional "Destination External Address" field.
// IEEE Std 802.11-2016, 9.4.2.115
struct PerrPerDestinationTail {
  uint16_t reason_code;
