iquery --recursive --sort --full_paths diagnostics
diagnostics:
  diagnostics#table:0x0:
    binary_data = Binary:
00000000	20 00 11 12 05                                  	 ....
    object_name = Example Table
    diagnostics#table:0x0/row:0x1:
      diagnostics#table:0x0/row:0x1/cell:0x2:
        double_value = 6.666667
        name = (0,0)
        value = 0
      diagnostics#table:0x0/row:0x1/cell:0x3:
        double_value = 13.333333
        name = (0,1)
        value = 0
      diagnostics#table:0x0/row:0x1/cell:0x4:
        double_value = 20.000000
        name = (0,2)
        value = 0
    diagnostics#table:0x0/row:0x11:
      diagnostics#table:0x0/row:0x11/cell:0x12:
        double_value = 86.666667
        name = (4,0)
        value = 0
      diagnostics#table:0x0/row:0x11/cell:0x13:
        double_value = 93.333333
        name = (4,1)
        value = 4
      diagnostics#table:0x0/row:0x11/cell:0x14:
        double_value = 100.000000
        name = (4,2)
        value = 8
    diagnostics#table:0x0/row:0x5:
      diagnostics#table:0x0/row:0x5/cell:0x6:
        double_value = 26.666667
        name = (1,0)
        value = 0
      diagnostics#table:0x0/row:0x5/cell:0x7:
        double_value = 33.333333
        name = (1,1)
        value = 1
      diagnostics#table:0x0/row:0x5/cell:0x8:
        double_value = 40.000000
        name = (1,2)
        value = 2
    diagnostics#table:0x0/row:0x9:
      diagnostics#table:0x0/row:0x9/cell:0xa:
        double_value = 46.666667
        name = (2,0)
        value = 0
      diagnostics#table:0x0/row:0x9/cell:0xb:
        double_value = 53.333333
        name = (2,1)
        value = 2
      diagnostics#table:0x0/row:0x9/cell:0xc:
        double_value = 60.000000
        name = (2,2)
        value = 4
    diagnostics#table:0x0/row:0xd:
      diagnostics#table:0x0/row:0xd/cell:0x10:
        double_value = 80.000000
        name = (3,2)
        value = 6
      diagnostics#table:0x0/row:0xd/cell:0xe:
        double_value = 66.666667
        name = (3,0)
        value = 0
      diagnostics#table:0x0/row:0xd/cell:0xf:
        double_value = 73.333333
        name = (3,1)
        value = 3
